Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УстановкаЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействияЦен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействияЦен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетБессрочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УУ_сабЗагрузитьИзExcelПосле(Команда)
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.УУ_ФормаЗагрузки",,ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УУ_ПериодДействияЦен.ДатаНачала = Объект.НачалоДействияЦен;
	УУ_ПериодДействияЦен.ДатаОкончания = Объект.ОкончаниеДействияЦен; 
	
	ПолеВвода = Элементы.Вставить("ДействуетБессрочно", Тип("ПолеФормы"), Элементы.ГруппаТипЦен, Элементы.ТипЦен);
	ПолеВвода.Заголовок = "Действует бессрочно";
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.ДействуетБессрочно"; 
	ПолеВвода.УстановитьДействие("ПриИзменении","ДействуетБессрочноПриИзменении");

	
	ПолеВвода = Элементы.Вставить("ПериодДействияТипаЦен", Тип("ПолеФормы"), Элементы.ГруппаТипЦен, Элементы.ДействуетБессрочно);
	ПолеВвода.Заголовок = "Период действия цен";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "УУ_ПериодДействияЦен"; 
	ПолеВвода.УстановитьДействие("ПриИзменении","УУ_ПериодДействияЦенПриИзменении"); 
	
	Элементы.ПериодДействияТипаЦен.Доступность = Не Объект.ДействуетБессрочно;
	
КонецПроцедуры

&НаКлиенте
Процедура УУ_ПериодДействияЦенПриИзменении(Элемент)

	Объект.НачалоДействияЦен = УУ_ПериодДействияЦен.ДатаНачала;
	Объект.ОкончаниеДействияЦен = УУ_ПериодДействияЦен.ДатаОкончания;  
	
	Если ЗначениеЗаполнено(УУ_ПериодДействияЦен.ДатаНачала) Или ЗначениеЗаполнено(УУ_ПериодДействияЦен.ДатаОкончания) Тогда
		Объект.ДействуетБессрочно = Ложь;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетБессрочноПриИзменении(Элемент)

	Объект.НачалоДействияЦен = "";
	Объект.ОкончаниеДействияЦен = ""; 
	УУ_ПериодДействияЦен = "";
	Элементы.ПериодДействияТипаЦен.Доступность = Не Объект.ДействуетБессрочно;
	Модифицированность = Истина;
	
КонецПроцедуры
